import type { ArtistType } from "../lib/types/Artist";

export const artists: ArtistType[] = [
    {
        id: 1,
        name: "Клод Моне",
        photo: "https://muzei-mira.com/templates/museum/images/artist/mone+.jpg",
        biography: "Французский живописец, один из основателей импрессионизма.\n Родился 14 ноября 1840 года в Париже.",
    },
    {
        id: 2,
        name: "Пьер Огюст Ренуар",
        photo: "https://muzei-mira.com/templates/museum/images/artist/renuar+.jpg",
        biography: "Французский живописец, график и скульптор, один из основных представителей импрессионизма. Известен, в первую очередь, как мастер светского портрета, не лишённого сентиментальности.",
    },
    {
        id: 3,
        name: "Эжен Делакруа",
        photo: "https://muzei-mira.com/templates/museum/images/artist/delakrua+.jpg",
        biography: "Эжен Делакруа родился возле Парижа в 1798 году 26 апреля. До сих пор так и неизвестно кто был отец Эжена Делакруа. То ли Шарль Делакруа, известный чиновник, то ли ребенок был незаконнорожденным, а отцом считался Шарль Талейран – министр иностранных дел во Франции.\nЭжен рос очень взбалмошным мальчиком. Его другом детства был Александр Дюма, который писал о Делакруа, что к трем годам, он уже вешался, травился и горел. Все это происходило с Эженом Делакруа по воле случая, но не без его помощи.\nУже обучаясь в лицее, и, проявив свой художественный талант, Делакруа стал спокойней. Он даже получал грамоты за свои работы, а также за знание классической литературы. Склонности к рисованию Эжен Делакруа перенял у своей матери, которую звали Виктория. Но именно страсть к живописи у Делакруа зародилась в сердце Нормандии. Его дядя был художником, и часто туда отправлялся, чтобы рисовать пейзажи.\nРодители будущего художника умерли рано, и Эжен первое время жил у сестры, пока она не попала в трудное финансовое положение. Тут перед Делакруа стала проблема, как жить дальше? Его выбором стала живопись. Он поступил в мастерскую Пьера Нарсисса Герена.",
    }
]