import type { PaintingType } from "../lib/types/Painting";

export const paintings: PaintingType[] = [ 
    {
        id: 1,
        authorId: 1,
        src: "https://muzei-mira.com/templates/museum/images/paint/prud-s-kuvshinkami-mone+.jpg",
        title: "Пруд с кувшинками",
        year: "1899",
        description: "Относится к позднему творчеству художника. В 1883 году Клод Моне приобрел дом в городке Живерни в Северной Нормандии. Купив соседний участок земли художник создал на его месте живописный сад с цветами, экзотическими деревьями, прудом с кувшинками и мостиком в японском стиле. В этом тенистом таинственном уголке Моне 30 лет писал целую серию картин с водяными лилиями.",
        museumIds: [],
    },
    {
        id: 2,
        authorId: 1,
        src: "https://muzei-mira.com/templates/museum/images/paint/dama-v-sadu-sent-andress+.jpg",
        title: "Дама в саду Сент-Адресс",
        year: "1867",
        description: "«Дама в саду Сент-Адресс» относится к ранним работам Моне, в которых он любил изображать людей на фоне летнего пейзажа. Художник стремился сделать человеческую фигуру частью природы, то есть одного целого, окружить ее светом и воздухом.",
        museumIds: [],
    },
    {
        id: 3,
        authorId: 1,
        src: "https://muzei-mira.com/templates/museum/images/paint/stog-sena-mone+.jpg",
        title: "Стог сена в Живерни",
        year: "1886",
        description: " «Стог сена в Живерни» - одна из наиболее известных картин из серии, посвящённой стогам. Яркая колористика работы придаёт сюжету некую абстрактность и набросочность. Стог сена со смещённой вершиной выдвинут на передний план, но как бы ни пытался автор акцентировать внимание на этот элемент, взгляд зрителя неизменно устремляется на цветущее поле. Рука мастера не только выписала поле в ярких тонах, но и придала ему движение – цветы колышутся на ветру, создавая неровную рябь на поверхности.",
        museumIds: [],
    },
    {
        id: 4,
        authorId: 1,
        src: "https://muzei-mira.com/templates/museum/images/paint/progulka-mone+.jpg",
        title: "Прогулка",
        year: "1875",
        description: "Любимая жена Камилла – частый гость на полотнах Моне. Причём живописцу зачастую хватало только её одной, даже когда сюжет требовал нескольких героинь – все они писались с Камиллы.\nКартина «Прогулка», или «Камилла Моне с сыном Жаном», или «Дама с зонтиком» была написана в 1875 году и изображает всю небольшую семью художника.\nВ работе Моне смог гармонично совместить статику и неуловимое движение – при довольно статичных позах героев, картину нельзя назвать застывшей и неподвижной. Мастер света и цвета, Моне оживил её за счёт яркого пейзажа и развивающихся одежд главной героини. Искусно выписанные складки пышной юбки мадам Моне создают характер и стремительное движение ветра.",
        museumIds: [],
    },
    {
        id: 5,
        authorId: 3,
        src: "https://muzei-mira.com/templates/museum/images/paint/portret-shopena-delakrua+.jpg",
        title: "Портрет Фредерика Шопена",
        year: "1838",
        description: "Не самая известная, к тому же незаконченная работа великого художника, тем не менее привлекает внимание критиков и публики уже почти два века. Все дело в истории создания работы. Мастер был дружен с композитором. Их объединял неукротимый творческий темперамент и жажда творчества. Работа не была заказана художнику, он начал писать портрет по собственному желанию. Более того, композитор никогда не позировал мастеру, работа должна была стать сюрпризом. Однако, закончен портрет не был. Как утверждал сам художник, его покинуло вдохновение и писать друга с 'холодным сердцем' мастер просто не мог.\nПеред зрителем бледный молодой человек с пышной, артистической шевелюрой. Смелыми, мощными мазками мастер создает образ энергичного, погруженного в свои раздумья человека. Ничто не отвлекает зрителя от лица героя. Нарочито строгая одежда, нейтральный фон. Мы можем только предполагать, каким бы выглядел композитор, если бы работа была закончена.\nХудожник всю свою жизнь слыл революционером и ниспровергателем живописных традиций. Но в этой незаконченной работе перед нами талантливый и образованный традиционалист, использующий все средства реализма для выражения непростого и гениального внутреннего мира великого музыканта.",
        museumIds: [],
    }
];